src/Documents/ПеремещениеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПеремещениеЗапасов</Name>
			<BasedOn>
				<xr:Item>Document.Поступление</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиницаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПартииНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Имущество</Name>
					<Comment>Имущество организации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводОстатков</Name>
					<Comment>Ввод остатков</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаЛицевойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносУчредителя</Name>
					<Comment>Взнос учредителя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыСтраховойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтСотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОшибочнойОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСЛицевогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеВКассу</Name>
					<Comment>Для фин. операций. Отправка банком ден. средств в организацию</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаДивидендовУчредителю</Name>
					<Comment>ВыплатаДивидендовУчредителю</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачислениеСертификата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеБонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтСтраховойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеМеждуСкладами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещенияМеждуСотрудниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСкладу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзКассы</Name>
					<Comment>Для фин. операций. Поступление фиксация поступления ден. средств в банк </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтЭквайера</Name>
					<Comment>Поступление от эквайера</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПоступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаНаличныхВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеБонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеРозничнойВыручкиИзОперационнойКассы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзКассыПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаРозничнойВыручкиВКассуПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеВОперационнуюКассу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ПеремещениеЗапасов/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидОперации = Объект.ВидОперации;
	
	УстановитьДоступностьЭлементов();
	
	ОбщегоНазначенияСтоматология.ЗаполнитьПризнакИспользованияХарактеристик(Объект.Запасы);
	СоздатьМенюУправленияТабличнымиЧастями();
	ОбновитьЗаголовкиТабЧастейНаСервере();   
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;
	
	// СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере(Метаданные.Документы.ПеремещениеЗапасов.ТабличныеЧасти.Запасы, НастройкиЗагрузкиДанных, ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	
	Если Объект.ПометкаУдаления = Истина Тогда
		Элементы.ГруппаСостояниеОбъекта.Видимость = Истина;	
		РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления, Объект.Проведен);		
	КонецЕсли;
	
КонецПроцедуры

// Процедура, обработчик события "ПослеЗаписи"
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбщегоНазначенияКлиентСтоматология.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение);
	Оповестить("ОБНОВИТЬ_СПИСОК_ПЕРЕМЕЩЕНИЯ_ЗАПАСОВ");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура, обработчик события "ПриИзменении" поле ввода "КоличествоУпаковок"
//
&НаКлиенте
Процедура ЗапасыКоличествоУпаковокПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы["Запасы"].ТекущиеДанные;
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьКоличествоЕдиницВСтрокеТЧКлиент(СтрокаТабличнойЧасти); 
	
КонецПроцедуры

// Процедура, обработчик собыитя "ПриИзменении" поле ввода "Номенклатура"
//
&НаКлиенте
Процедура ЗапасыНоменклатураПриИзменении(Элемент)
	
	СтрокаДанных = Элементы.Запасы.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(СтрокаДанных.Упаковка) Тогда	
		СтрокаДанных.Упаковка = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаДанных.Номенклатура, "УпаковкаПоумолчанию");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаДанных.КоличествоУпаковок) Тогда
		СтрокаДанных.КоличествоУпаковок = 1;
	КонецЕсли;
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьКоличествоЕдиницВСтрокеТЧКлиент(СтрокаДанных);
	
	СтрокаДанных.ХарактеристикиИспользуются = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаДанных.Номенклатура, "ИспользоватьПартии");
	СтрокаДанных.ЭтоСертификат = (ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаДанных.Номенклатура, "ТипНоменклатуры") = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПодарочныйСертификат"));
	ОбновитьЗаголовкиТабЧастейНаСервере();

	
КонецПроцедуры

// Процедура, обработчик события "ПриИзменении" поле ввода "Упаковка"
//
&НаКлиенте
Процедура ЗапасыУпаковкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Запасы.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПриИзмененииУпаковкиТабЧасти(ТекущаяСтрока);
	
КонецПроцедуры

// Процедура, обработчик события "НачалоВыбора" поле ввода "Упаковка"
//
&НаКлиенте
Процедура ЗапасыУпаковкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработкаТабличныхЧастейКлиент.ВыбратьУпаковкуНоменклатуры(ДанныеВыбора, СтандартнаяОбработка, Элементы.Запасы.ТекущиеДанные);
	
КонецПроцедуры

// Процедура оработчик команды "Подбор"
//
&НаКлиенте
Процедура Подбор(Команда)
	ИмяТабличнойЧасти  = "Запасы";
	ЕстьПартии		   = Истина;
		
	ПараметрыПодбора = Новый Структура;
	
	ПараметрыПодбора.Вставить("Период",				   Объект.Дата);
	ПараметрыПодбора.Вставить("Склад",	   			   Объект.Склад);
	ПараметрыПодбора.Вставить("СтруктурнаяЕдиница",	   Объект.СтруктурнаяЕдиница);
	ПараметрыПодбора.Вставить("ИспользуетсяСодержание",Истина);

	Если Объект[ИмяТабличнойЧасти].Количество() > 0 Тогда
		АдресЗапасовВХранилище = ПоместитьЗапасыВХранилище(ИмяТабличнойЧасти, ЕстьПартии);
		ПараметрыПодбора.Вставить("АдресЗапасовДокумента", АдресЗапасовВХранилище);
	КонецЕсли; 
	
	ТипНоменклатуры = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Номенклатура"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.ТипНоменклатуры" Тогда
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					ТипНоменклатуры.Добавить(ЭлементФиксМассива);
				КонецЦикла; 
			Иначе
				ТипНоменклатуры.Добавить(ЭлементМассива.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ПараметрыПодбора.Вставить("ТипНоменклатуры",	   ТипНоменклатуры);
		
	СтатусПартии = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Партия"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.Статус" Тогда			
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					СтатусПартии.Добавить(ЭлементФиксМассива);
				КонецЦикла; 
			Иначе
				СтатусПартии.Добавить(ЭлементМассива.Значение);
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;
	ПараметрыПодбора.Вставить("СтатусПартии",	   		СтатусПартии);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
	ДополнительныеПараметры.Вставить("ЕстьПартии", ЕстьПартии);

	ОткрытьФорму("ОбщаяФорма.ФормаПодбора",
	ПараметрыПодбора,,,,,
	Новый ОписаниеОповещения("ПодборЗавершение", ЭтотОбъект, ДополнительныеПараметры), 
	РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура - После выбора подбора
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПодборЗавершение(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(РезультатВыбора) Тогда
		ПолучитьЗапасыИзХранилища(РезультатВыбора, ДополнительныеПараметры.ИмяТабличнойЧасти, ДополнительныеПараметры.ЕстьПартии);
		ОбновитьЗаголовкиТабЧастейНаСервере();
	КонецЕсли; 	
	
КонецПроцедуры

&НаСервере
// Функция получает список товаров из временного хранилища
//
Процедура ПолучитьЗапасыИзХранилища(АдресЗапасовВХранилище, ИмяТабличнойЧасти, ЕстьПартии)
	
	ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(АдресЗапасовВХранилище);
	
	Для каждого СтрокаЗагрузки Из ТаблицаДляЗагрузки Цикл
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Номенклатура", СтрокаЗагрузки.Номенклатура);
		СтруктураОтбора.Вставить("Упаковка", СтрокаЗагрузки.Упаковка);
		Если ЕстьПартии Тогда
			СтруктураОтбора.Вставить("Партия", СтрокаЗагрузки.Партия);
		КонецЕсли;
		
		Строки = Объект[ИмяТабличнойЧасти].НайтиСтроки(СтруктураОтбора);
		Если Строки.Количество() > 0 Тогда
			СтрокаТабличнойЧасти = Строки[0];
		Иначе
			СтрокаТабличнойЧасти = Объект[ИмяТабличнойЧасти].Добавить();
		КонецЕсли;
		
	    СтрокаТабличнойЧасти.Номенклатура =  СтрокаЗагрузки.Номенклатура;
		СтрокаТабличнойЧасти.ХарактеристикиИспользуются = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаТабличнойЧасти.Номенклатура, "ИспользоватьПартии");
		СтрокаТабличнойЧасти.ЭтоСертификат = (ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаТабличнойЧасти.Номенклатура, "ТипНоменклатуры") = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПодарочныйСертификат"));
		СтрокаТабличнойЧасти.Партия = СтрокаЗагрузки.Партия;
		СтрокаТабличнойЧасти.КоличествоУпаковок =  СтрокаЗагрузки.КоличествоУпаковок;
		СтрокаТабличнойЧасти.Количество = СтрокаЗагрузки.Количество;
		СтрокаТабличнойЧасти.Упаковка = СтрокаЗагрузки.Упаковка;
			
	КонецЦикла;
	
КонецПроцедуры // ПолучитьЗапасыИзХранилища()

&НаСервере
// Функция помещает список запасов во временное хранилище и возвращает адрес 
//
Функция ПоместитьЗапасыВХранилище(ИмяТабличнойЧасти, ЕстьПартии) 
	
	СписокКолонок = "Номенклатура, Количество, КоличествоУпаковок,  Упаковка";
	Если ЕстьПартии Тогда
		СписокКолонок = СписокКолонок + ", Партия";
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(Объект[ИмяТабличнойЧасти].Выгрузить(, СписокКолонок), УникальныйИдентификатор);
	
КонецФункции // ПоместитьЗапасыВХранилище()

&НаКлиенте
// Процедура, обработчик события НачалоВыбора
//
Процедура СкладНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.ВидОперации) тогда
		СтандартнаяОбработка = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите вид операции!");
		Возврат; 
	Иначе
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПеремещенияМеждуСотрудниками") ИЛИ  
			Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратОтСотрудника") Тогда 
			СтандартнаяОбработка = Ложь; 
			ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаВыбора", Новый Структура("РежимВыбора, БезОтбораПоРолям", Истина, Истина),,,,,Новый ОписаниеОповещения("ВыборСотрудникаЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры
 
&НаКлиенте
// Процедура, обработчик события НачалоВыбора
//
Процедура СкладПолучательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.ВидОперации) тогда
		СтандартнаяОбработка = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите вид операции!");
		Возврат; 
	Иначе
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПеремещенияМеждуСотрудниками") ИЛИ 
			Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПередачаСотруднику") Тогда 
			СтандартнаяОбработка = Ложь; 
			ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаВыбора", Новый Структура("РежимВыбора, БезОтбораПоРолям", Истина, Истина),,,,,Новый ОписаниеОповещения("ВыборСотрудникаПолучателяЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры
 
&НаКлиенте
// Процедура, обработчик события ПриОткрытии
//
Процедура ПриОткрытии(Отказ)
	
	// МеханизмВнешнегоОборудования
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		ОписаниеОшибки = "";
		
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
		
		Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
			ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:
			|""%ОписаниеОшибки%"".'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	// Конец МеханизмВнешнегоОборудования 
	
	Объект.Запасы.Сортировать("Номенклатура");	
	
КонецПроцедуры
 
&НаКлиенте
// Процедура, обработчик события ОбработкаОповещения
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ВнешнееОборудование
	Если Источник = "ВнешнееОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			Данные = Новый Массив();
			Если Параметр[1] = Неопределено Тогда
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[0], 1)); // Достаем штрихкод из основных данных
			Иначе
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[1][1], 1)); // Достаем штрихкод из дополнительных данных
			КонецЕсли;
			ПолученыШтрихкоды(Данные);
		ИначеЕсли ИмяСобытия = "DataCollectionTerminal" Тогда
			ПолученыШтрихкоды(Параметр);
		КонецЕсли;
	КонецЕсли;
	// Конец ВнешнееОборудование 	
	
	Если Источник = "ВнешнееОборудование" И ИмяСобытия = "НеизвестныеШтрихкоды" 
			И УникальныйИдентификатор = Параметр.ФормаВладелецУникальныйИдентификатор Тогда
		ПолученыШтрихкоды(Параметр.ЗарегистрированныеШтрихкоды);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// ==================================================МеханизмВнешнегоОборудования======================================================

&НаКлиенте
//
//
Функция ПолученыШтрихкоды(ДанныеШтрикодов)
	
	НеизвестныеШтрихкоды = Новый Массив;
	
	Для Каждого ЭлементШтрихкода Из ДанныеШтрикодов Цикл
		Если ОбработкаТабличныхЧастейКлиент.СШКОбработкаТабличнойЧасти(Элементы.Запасы, ЭлементШтрихкода, , , Объект.Ссылка, Объект.Запасы, НеизвестныеШтрихкоды) Тогда
			ЗапасыНоменклатураПриИзменении(Элементы.Запасы.ТекущиеДанные);
			ЗапасыУпаковкаПриИзменении(Элементы.Запасы.ТекущиеДанные);		
		КонецЕсли;
		Если НеизвестныеШтрихкоды.Количество() > 0 Тогда 
			СтруктураПараметров = Новый Структура("НеизвестныеШтрихкоды", НеизвестныеШтрихкоды);
			ОткрытьФорму("РегистрСведений.Штрихкоды.Форма.РегистрацияШтрихкодовНоменклатуры", СтруктураПараметров, ЭтаФорма);
		КонецЕсли;
	КонецЦикла;						
	
КонецФункции // ПолученыШтрихкоды()

&НаКлиенте
// ПодключаемоеОборудование
// Процедура - обработчик команды командной панели табличной части.
//
Процедура ПоискПоШтрихкоду(Команда)
	
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект), "", НСтр("ru = 'Введите штрихкод'"));
	
КонецПроцедуры

&НаКлиенте
// Процедура - Поиск по штрихкоду завершение
//
// Параметры:
//  Значение				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПоискПоШтрихкодуЗавершение(Значение, ДополнительныеПараметры) Экспорт
	
	ТекШтрихкод = ?(Значение = Неопределено, "", Значение);
	    	
	Если НЕ ПустаяСтрока(ТекШтрихкод) Тогда
		МассивШтрихкод = Новый Массив;
		МассивШтрихкод.Добавить(Новый Структура("Штрихкод, Количество", ТекШтрихкод, 1));
		ПолученыШтрихкоды(МассивШтрихкод);
	КонецЕсли;

КонецПроцедуры

// ================================================Конец МеханизмВнешнегоОборудования==================================================

&НаКлиенте
Процедура СтруктурнаяЕдиницаПриИзменении(Элемент)
	
	Объект.Склад = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементов(ТипСтр = "СправочникСсылка.", ТипСтрП = "СправочникСсылка.")
	
	Если Объект.ВидОперации = Перечисления.ВидыОпераций.ПеремещениеМеждуСкладами Тогда
		
		ТипСтр 								= ТипСтр + "Склады";
		ТипСтрП 							= ТипСтрП  + "Склады";
		Элементы.Склад.Заголовок            = "Склад отправитель";
		Элементы.СкладПолучатель.Заголовок  = "Склад получатель";
		// установка связей параметров выбора 
		ОрганизацияПоСЕ = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Объект.СтруктурнаяЕдиница, "Организация");
 		Организация 	= ?(Не ЗначениеЗаполнено(ОрганизацияПоСЕ), Справочники.Организации.ПустаяСсылка(), ОрганизацияПоСЕ);
		НоваяСвязь 		= Новый СвязьПараметраВыбора("Отбор.Организация", "Организация", РежимИзмененияСвязанногоЗначения.Очищать);
		Массив	   		= Новый Массив();
		Массив.Добавить(НоваяСвязь);
		Элементы.СтруктурнаяЕдиницаПолучатель.СвязиПараметровВыбора = Новый ФиксированныйМассив(Массив);
		
	Иначе
		
		Элементы.СтруктурнаяЕдиницаПолучатель.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый Массив()); 
		
		Если Объект.ВидОперации = Перечисления.ВидыОпераций.ВозвратОтСотрудника Тогда
			
			ТипСтр 								= ТипСтр + "Сотрудники";
			ТипСтрП 							= ТипСтрП  + "Склады";			
			Элементы.Склад.Заголовок           = "Персонал отправ.";
			Элементы.СкладПолучатель.Заголовок = "Склад получатель";   
			
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ПередачаСотруднику Тогда
			
			ТипСтр 								= ТипСтр + "Склады";
			ТипСтрП 							= ТипСтрП  + "Сотрудники";			
			Элементы.Склад.Заголовок           = "Склад отправитель";
			Элементы.СкладПолучатель.Заголовок = "Персонал получат.";   
			
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.ПеремещенияМеждуСотрудниками Тогда
			
			ТипСтр 								= ТипСтр + "Сотрудники";
			ТипСтрП 							= ТипСтрП  + "Сотрудники";			
			Элементы.Склад.Заголовок           = "Персонал отправ.";		
			Элементы.СкладПолучатель.Заголовок = "Персонал получат.";  
			
		Иначе
			Возврат;
		КонецЕсли;
		
	КонецЕсли;

	Элементы.Склад.ОграничениеТипа = Новый ОписаниеТипов(ТипСтр);
	Элементы.СкладПолучатель.ОграничениеТипа = Новый ОписаниеТипов(ТипСтрП);
	Элементы.СтруктурнаяЕдиница.Доступность = Не (Новый ОписаниеТипов(ТипСтр) = Новый ОписаниеТипов("СправочникСсылка.Склады"));
	Элементы.СтруктурнаяЕдиницаПолучатель.Доступность = Не (Новый ОписаниеТипов(ТипСтрП) = Новый ОписаниеТипов("СправочникСсылка.Склады"));	
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктурнаяЕдиницаПолучательПриИзменении(Элемент)

	Объект.СкладПолучатель = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВидОперации = Объект.ВидОперации;

КонецПроцедуры    

&НаКлиенте
// Процедура, обработчик события "ЗапасыПартияНачалоВыбораЗавершение"
//
Процедура ЗапасыПартияНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	
	СтрокаТабличнойЧасти = Параметры;
	Если НЕ Результат = Неопределено Тогда
		СтрокаТабличнойЧасти.Партия = Результат[0];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	Если Объект.ВидОперации <> ВидОперации Тогда
		
		Объект.Склад = Неопределено;
		// Объект.СтруктурнаяЕдиница = Неопределено;
		УстановитьДоступностьЭлементов();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПослеЗаписиНаСервере"
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияСтоматология.ЗаполнитьПризнакИспользованияХарактеристик(Объект.Запасы);	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора"
//
Процедура ЗапасыПартияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) Тогда
		
		мПараметрыВыбора = Новый Структура;
		мПараметрыВыбора.Вставить("Владелец"                       , СтрокаТабличнойЧасти.Номенклатура);
		мПараметрыВыбора.Вставить("Склад"                          , Объект.Склад);
		мПараметрыВыбора.Вставить("СтруктурнаяЕдиница"             , Объект.СтруктурнаяЕдиница);
		мПараметрыВыбора.Вставить("Дата"                           , Объект.Дата);
		мПараметрыВыбора.Вставить("МножественныйВыбор"             , Истина);

		ОткрытьФорму("Справочник.ПартииНоменклатуры.ФормаВыбора", мПараметрыВыбора,,,,,Новый ОписаниеОповещения("ЗапасыПартияНачалоВыбораЗавершение", ЭтотОбъект, СтрокаТабличнойЧасти), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;     	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ВыборСотрудникаЗавершение"
//
Процедура ВыборСотрудникаЗавершение(Результат, Параметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Склад = Результат;
		
КонецПроцедуры   

&НаКлиенте
// Процедура, обработчик события "ВыборСотрудникаПолучателяЗавершение"
//
Процедура ВыборСотрудникаПолучателяЗавершение(Результат, Параметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.СкладПолучатель = Результат;
		
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ЗагрузитьДанныеИзТСД", загружает данные из ТСД
//
Процедура ЗагрузитьДанныеИзТСД(Команда)
	
	МенеджерОборудованияКлиент.ЗагрузитьДанныеИзТСД(УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
// Процедура печати документов.
//
Процедура ДокументПечать(Команда)
	
	МассивДокументов = Новый Массив;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		МассивДокументов.Добавить(Объект.Ссылка);
	КонецЕсли;
	
	Структура = Новый Структура;
	Структура.Вставить("ИмяДокумента", "ПеремещениеЗапасов");
	Структура.Вставить("МассивДокументов", МассивДокументов);
	
	СписокПечатныхФорм = ПолучитьСписокПечати();
	Оповещение = Новый ОписаниеОповещения("ДокументПечатьОбработкаВыбора", ЭтотОбъект, Структура);	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		
		СтруктураВопроса = Новый Структура;
		СтруктураВопроса.Вставить("СписокПечатныхФорм", СписокПечатныхФорм);
		СтруктураВопроса.Вставить("Оповещение", Оповещение);
		ОповещениеДляВопроса = Новый ОписаниеОповещения("ПослеВопросаЗавершение", ЭтотОбъект, СтруктураВопроса);			
		ПоказатьВопрос(ОповещениеДляВопроса, "Данные ещё не записаны. Записать?", РежимДиалогаВопрос.ДаНет);
		
	Иначе	
		
		ПоказатьВыборИзМеню(Оповещение, СписокПечатныхФорм, Элементы.ФормаДокументаПечать);
		
	КонецЕсли;   				
	
КонецПроцедуры

&НаКлиенте
// Процедура После вопроса завврешение.
//
Процедура ПослеВопросаЗавершение(Результат, Параметры) Экспорт	
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ПроверитьЗаполнение() = Истина Тогда		
			ЭтаФорма.Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));			
		КонецЕсли; 		
		// ПоказатьВыборИзМеню(Параметры.Оповещение, Параметры.СписокПечатныхФорм, Элементы.ФормаДокументаПечать);		
	Иначе
		Возврат;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура печати.
//
Процедура ДокументПечатьОбработкаВыбора(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Значение = "НакладнаяНаПеремещениеПоТипуЦен" Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ВидЦен", ВидЦенПоУмолчаниюДляПечати());
		СтруктураПараметров.Вставить("Перемещение", "Перемещение");
		ПараметрыОповещения = Новый Структура("Результат, Параметры", Результат, Параметры);
		ОткрытьФорму("ОбщаяФорма.ФормаЦены", СтруктураПараметров,,,,, Новый ОписаниеОповещения("ОбработкаВыборФорматаЦены", ЭтотОбъект, ПараметрыОповещения), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
					
	Иначе
		УправлениеПечатьюКлиентСтоматология.ОбработкаКоманды(Результат, Параметры);	
	КонецЕсли;
		
КонецПроцедуры

// Функция, получается вид цен
// 
&НаСервереБезКонтекста
Функция ВидЦенПоУмолчаниюДляПечати()
	Возврат Справочники.ВидыЦен.Закупочная;
КонецФункции

// Процедура - обработчик выбора формата цены для печати накладной по типу цен
//
&НаКлиенте
Процедура ОбработкаВыборФорматаЦены(Результат, ПереданныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Результат = КодВозвратаДиалога.Отмена Тогда 
		
		МассивДляПараметров = Новый Массив;
		МассивДляПараметров.Добавить(ПереданныеПараметры.Параметры.МассивДокументов);
		МассивДляПараметров.Добавить(Результат.ВидЦен);	
		ПереданныеПараметры.Параметры.МассивДокументов = МассивДляПараметров;
		
		УправлениеПечатьюКлиентСтоматология.ОбработкаКоманды(ПереданныеПараметры.Результат, ПереданныеПараметры.Параметры);
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
// Функция Получить список печатных форм.
//
Функция ПолучитьСписокПечати()                           	
	Возврат Документы.ПеремещениеЗапасов.ПолучитьСписокПечатныхФорм();	
КонецФункции

&НаСервере
// Процедура, создает меню управления табличными частями.
//
Процедура СоздатьМенюУправленияТабличнымиЧастями()
	
	СтруктураМеню = Новый Структура;
	СтруктураМеню.Вставить("Запасы"        , "ГруппаЗапасы");
	СтруктураМеню.Вставить("Дополнительно" , "ГруппаДополнительно");
		
	ОбработкаТабличныхЧастейКлиент.СоздатьМенюДокумента(ЭтаФорма, СтруктураМеню, "ГруппаПереключательЗакладок");
	
КонецПроцедуры

&НаСервере
// Процедура, выполняет подсчет количества строк в таб.частях и выводит его в заголовок панели.
//
Процедура ОбновитьЗаголовкиТабЧастейНаСервере()
	
	ОбработкаТабличныхЧастейКлиент.ОбновитьЗаголовкиТабЧастей(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет обработку нажатия динамических кнопок.
//
Процедура ПроцедураОбработкиНажатияМеню(Элемент)
	
	ОбработатьНажатиеМеню(Элемент.Имя);
	
КонецПроцедуры

&НаСервере
// Процедура, обрабатывает нажатие динамических кнопок.
//
Процедура ОбработатьНажатиеМеню(ИмяЭлемента)
	
	ОбработкаТабличныхЧастейКлиент.ПроцедураОбработкиНажатияМеню(ЭтаФорма, ИмяЭлемента);
			
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПослеУдаления".
//
Процедура ЗапасыПослеУдаления(Элемент)
	
	ОбновитьЗаголовкиТабЧастейНаСервере();

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ЗапасыПриИзменении(Элемент)
	ОбновитьЗаголовкиТабЧастейНаСервере();
КонецПроцедуры

&НаКлиенте 
// Процедура, Дата при изменении.
//
Процедура ДатаПриИзменении(Элемент)
	
  ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			Объект.Номер = "";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста  
// Функция, Получить данные даты при изменении.
//
Функция ПолучитьДанныеДатаПриИзменении(ДокументСсылка, ДатаНовая, ДатаПередИзменением)
	
	РазностьДат = ДвиженияДокументовСервер.ПроверитьНомерДокумента(ДокументСсылка, ДатаНовая, ДатаПередИзменением);
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("РазностьДат", РазностьДат);
			
	Возврат СтруктураДанные;
	
КонецФункции

#Область ЗагрузкаДанныхИзВнешнегоИсточника

&НаКлиенте
// Процедура обработчик команды "Импорт".
// 
Процедура Импорт(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
	
	НастройкиЗагрузкиДанных.Вставить("ПолноеИмяТабличнойЧасти", "ПеремещениеЗапасов.Запасы");
	НастройкиЗагрузкиДанных.Вставить("ПолноеИмяОбъектаЗаполнения", "Документ.ПеремещениеЗапасов.ТабличнаяЧасть.Запасы");
	НастройкиЗагрузкиДанных.Вставить("Заголовок", НСтр("ru = 'Загрузка запасов из файла'"));
	НастройкиЗагрузкиДанных.Вставить("СодержаниеВидимо", Истина);

	ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);

КонецПроцедуры

// СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника

&НаСервере
// Процедура, загрузка из фала на сервере (альтернатива).
// 
Процедура ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных)
	
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	
	ТоварыДобавлены = Ложь;
	Для каждого СтрокаТаблицы Из ЗагруженныеДанные Цикл 
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока  = Объект.Запасы.Добавить();
		ИменаСвойств = "Номенклатура, Количество";
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы, ИменаСвойств);
		
		НоваяСтрока.КоличествоУпаковок  = СтрокаТаблицы.Количество;
		НоваяСтрока.Упаковка		    = ?(ЗначениеЗаполнено(СтрокаТаблицы.УпаковкаПоУмолчанию), СтрокаТаблицы.УпаковкаПоУмолчанию, СтрокаТаблицы.Номенклатура.УпаковкаПоумолчанию);	
		НоваяСтрока.ХарактеристикиИспользуются = СтрокаТаблицы.Номенклатура.ИспользоватьПартии;
		НоваяСтрока.Партия			    = СтрокаТаблицы.Партия;
		
		ОбработкаТабличныхЧастейКлиент.ПересчитатьКоличествоЕдиницВСтрокеТЧКлиент(НоваяСтрока);
		
		ТоварыДобавлены = Истина;
		
	КонецЦикла;
	
	Если ТоварыДобавлены Тогда	
		Модифицированность = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Процедура, загрузка из файла завершение (альтернатива).
//
Процедура ЗагрузитьИзФайлаЗавершение(АдресЗагруженныхДанных)
	
	Если АдресЗагруженныхДанных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработка результата.
//
Процедура ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата(РезультатЗагрузки, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗагрузки) = Тип("Структура") Тогда
		
		Если РезультатЗагрузки.ОписаниеДействия = "ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника" Тогда
		
			ЗагрузкаДанныхИзВнешнегоИсточника.ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных.ИмяФормыЗагрузкиДанныхИзВнешнихИсточников);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
			ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
			
		ИначеЕсли РезультатЗагрузки.ОписаниеДействия = "ОбработатьПодготовленныеДанные" Тогда
			
			ОбработатьПодготовленныеДанные(РезультатЗагрузки);
			
		КонецЕсли;
		
	Иначе	
		ЗагрузитьИзФайлаЗавершение(РезультатЗагрузки);	
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
// Процедура, добавляет данные в табличную часть.
//
Процедура ОбработатьПодготовленныеДанные(РезультатЗагрузки)
	
	Попытка
		
		НачатьТранзакцию();
		
		ТаблицаСопоставленияДанных = РезультатЗагрузки.ТаблицаСопоставленияДанных;
		Для каждого СтрокаТаблицы Из ТаблицаСопоставленияДанных Цикл
			
			ЗагрузкаВПриложениеВозможна = СтрокаТаблицы[ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна()];
			Если ЗагрузкаВПриложениеВозможна Тогда
				
				НоваяСтрока = Объект.Запасы.Добавить();
				
				ИменаСвойств = "Номенклатура, Количество";
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы, ИменаСвойств);
				
				НоваяСтрока.КоличествоУпаковок  = СтрокаТаблицы.Количество;
				НоваяСтрока.Упаковка		    = ?(ЗначениеЗаполнено(СтрокаТаблицы.УпаковкаПоУмолчанию), СтрокаТаблицы.УпаковкаПоУмолчанию, СтрокаТаблицы.Номенклатура.УпаковкаПоумолчанию);	
				НоваяСтрока.ХарактеристикиИспользуются = СтрокаТаблицы.Номенклатура.ИспользоватьПартии;
				НоваяСтрока.Партия			    = СтрокаТаблицы.Партия;
				
				ОбработкаТабличныхЧастейКлиент.ПересчитатьКоличествоЕдиницВСтрокеТЧКлиент(НоваяСтрока);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		ОбновитьЗаголовкиТабЧастейНаСервере();
		
	Исключение
		
		ЗаписьЖурналаРегистрации(Нстр("ru='Загрузка данных'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ПеремещениеЗапасов, , ОписаниеОшибки());
		ОтменитьТранзакцию();
		
	КонецПопытки;
		
КонецПроцедуры

&НаСервере
// Процедура При чтении на сервере.
//
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления, Объект.Проведен);
	
	Если Объект.ПометкаУдаления = Истина Тогда
		Элементы.ГруппаСостояниеОбъекта.Видимость = Истина;	
	Иначе
		Элементы.ГруппаСостояниеОбъекта.Видимость = Ложь;	
	КонецЕсли; 
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника

#КонецОбласти


#КонецОбласти
